benchmarks/frontends/express/fetch.log
          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: benchmark.js
     output: pages/express/fetch.log

  scenarios: (100.00%) 1 scenario, 30 max VUs, 2m30s max duration (incl. graceful stop):
           * default: 30 looping VUs for 2m0s (gracefulStop: 30s)


running (2m00.0s), 00/30 VUs, 618888 complete and 0 interrupted iterations
default ✓ [======================================] 30 VUs  2m0s

     data_received..................: 1.4 GB 12 MB/s
     data_sent......................: 50 MB  413 kB/s
     http_req_blocked...............: min=681ns    max=3.25ms  avg=1.24µs  med=1.08µs  p(95)=1.65µs  p(99)=2.79µs 
     http_req_connecting............: min=0s       max=1.29ms  avg=40ns    med=0s      p(95)=0s      p(99)=0s     
     http_req_duration..............: min=279.62µs max=35.41ms avg=5.78ms  med=5.31ms  p(95)=8.53ms  p(99)=10.88ms
       { expected_response:true }...: min=279.62µs max=35.41ms avg=5.78ms  med=5.31ms  p(95)=8.53ms  p(99)=10.88ms
     http_req_failed................: 0.00%  ✓ 0           ✗ 618888
     http_req_receiving.............: min=10.65µs  max=11.87ms avg=23.96µs med=22.73µs p(95)=31.23µs p(99)=41.96µs
     http_req_sending...............: min=3.36µs   max=9.21ms  avg=5.4µs   med=4.91µs  p(95)=7.59µs  p(99)=10.07µs
     http_req_tls_handshaking.......: min=0s       max=0s      avg=0s      med=0s      p(95)=0s      p(99)=0s     
     http_req_waiting...............: min=259.33µs max=35.39ms avg=5.75ms  med=5.28ms  p(95)=8.5ms   p(99)=10.85ms
     http_reqs......................: 618888 5157.145437/s
     iteration_duration.............: min=302.36µs max=35.43ms avg=5.81ms  med=5.34ms  p(95)=8.56ms  p(99)=10.91ms
     iterations.....................: 618888 5157.145437/s
     vus............................: 30     min=30        max=30  
     vus_max........................: 30     min=30        max=30